SenHe524/stmf407_learn/stm32f407_w5500/User/w5500/W5500.c
/**********************************************************************************
 * 文件名  ：W5500.c
 * 描述    ：W5500 驱动函数库         
 * 库版本  ：ST_v3.5
 * 作者    ：泥人通信模块开发团队
 * 博客    ：http://nirenelec.blog.163.com
 * 淘宝    ：http://nirenelec.taobao.com
**********************************************************************************/

#include "stm32f4xx.h"                  // Device header
			
#include "W5500.h"	
#include "delay.h"
/***************----- 网络参数变量定义 -----***************/
unsigned char Gateway_IP[4] = {192,168,1,1};	//网关IP地址 
unsigned char Sub_Mask[4] = {255,255,255,0};	//子网掩码 
unsigned char Phy_Addr[6] = {0x00,0x08,0xDC,0x01,0x02,0x03};	//物理地址(MAC) 
unsigned char IP_Addr[4] = {192,168,1,199};	//本机IP地址 
unsigned char S0_Port[2] = {0x1E,0x40};	//端口0的端口号(5000) 

unsigned char S0_DIP[4] = {192,168,1,190};		//端口0目的IP地址 
unsigned char S0_DPort[2] = {0x1F,0x40};	//端口0目的端口号(6000) 

unsigned char UDP_DIPR[4];	//UDP(广播)模式,目的主机IP地址
unsigned char UDP_DPORT[2];	//UDP(广播)模式,目的主机端口号

/***************----- 端口的运行模式 -----***************/
#define TCP_SERVER	0x00	//TCP服务器模式
#define TCP_CLIENT	0x01	//TCP客户端模式 
#define UDP_MODE	0x02	//UDP(广播)模式 
unsigned char S0_Mode =TCP_SERVER;	//端口0的运行模式,0:TCP服务器模式,1:TCP客户端模式,2:UDP(广播)模式
/***************----- 端口的运行状态 -----***************/
unsigned char S0_State =0;	//端口0状态记录,1:端口完成初始化,2端口完成连接(可以正常传输数据) 
#define S_INIT		0x01	//端口完成初始化 
#define S_CONN		0x02	//端口完成连接,可以正常传输数据 

/***************----- 端口收发数据的状态 -----***************/
unsigned char S0_Data;		//端口0接收和发送数据的状态,1:端口接收到数据,2:端口发送数据完成 
#define S_RECEIVE	 0x01	//端口接收到一个数据包 
#define S_TRANSMITOK 0x02	//端口发送一个数据包完成 

/***************----- 端口数据缓冲区 -----***************/
unsigned char Rx_Buffer[2048];	//端口接收数据缓冲区 
unsigned char Tx_Buffer[2048];	//端口发送数据缓冲区 

unsigned char W5500_Interrupt;	//W5500中断标志(0:无中断,1:有中断)

/*******************************************************************************
* 函数名  : W5500_GPIO_Configuration
* 描述    : W5500 GPIO初始化配置
* 输入    : 无
* 输出    : 无
* 返回值  : 无
* 说明    : 无
*******************************************************************************/
void W5500_GPIO_Configuration(void)
{
	GPIO_InitTypeDef GPIO_InitStructure;
	EXTI_InitTypeDef  EXTI_InitStructure;	
	RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_GPIOF, ENABLE);
	RCC_APB2PeriphClockCmd(RCC_APB2Periph_EXTIT, ENABLE);
	RCC_APB2PeriphClockCmd(RCC_APB2Periph_SYSCFG, ENABLE);//使能SYSCFG时钟
	/* W5500_SPI3_RST引脚初始化配置(PF11) */
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_OUT;
	GPIO_InitStructure.GPIO_OType = GPIO_OType_PP;// 推挽输出
	GPIO_InitStructure.GPIO_Pin = W5500_SPI3_RST;
	GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_UP;// 上拉
	GPIO_InitStructure.GPIO_Speed = GPIO_High_Speed;
	GPIO_Init(W5500_SPI3_IR_PORT, &GPIO_InitStructure);
	GPIO_SetBits(W5500_SPI3_IR_PORT, W5500_SPI3_RST);
	
	/* W5500_INT引脚初始化配置(PF12) */
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IN;
	GPIO_InitStructure.GPIO_OType = GPIO_OType_PP;
	GPIO_InitStructure.GPIO_Pin = W5500_SPI3_INT;
	GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_UP;
	GPIO_InitStructure.GPIO_Speed = GPIO_High_Speed;
	GPIO_Init(W5500_SPI3_IR_PORT, &GPIO_InitStructure);	

	/* Connect EXTI Line12 to PF12 */
	SYSCFG_EXTILineConfig(EXTI_PortSourceGPIOF, EXTI_PinSource12);
	
	/* PC4 as W5500 interrupt input */
	EXTI_InitStructure.EXTI_Line = EXTI_Line12;
	EXTI_InitStructure.EXTI_Mode = EXTI_Mode_Interrupt;
	EXTI_InitStructure.EXTI_Trigger = EXTI_Trigger_Falling;
	EXTI_InitStructure.EXTI_LineCmd = ENABLE;
	EXTI_Init(&EXTI_InitStructure);
	
	/*
	抢占优先级高的可以打断当前中断，实现中断嵌套，响应优先级
	高的可以优先排队，抢占优先级和响应优先级相同的按中断号排队
	*/
	
	NVIC_InitTypeDef NVIC_InitStructure;
	NVIC_PriorityGroupConfig(NVIC_PriorityGroup_2);
	/* Enable the EXTI4 Interrupt */
	NVIC_InitStructure.NVIC_IRQChannel = EXTI15_10_IRQn;
	NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 0;
	NVIC_InitStructure.NVIC_IRQChannelSubPriority = 0;
	NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
	NVIC_Init(&NVIC_InitStructure);
}


/*******************************************************************************
* 函数名  : EXTI4_IRQHandler
* 描述    : 中断线4中断服务函数(W5500 INT引脚中断服务函数)
* 输入    : 无
* 输出    : 无
* 返回值  : 无
* 说明    : 无
*******************************************************************************/
void EXTI15_10_IRQHandler(void)
{
	if(EXTI_GetITStatus(EXTI_Line12) != RESET)
	{
		EXTI_ClearITPendingBit(EXTI_Line12);
		W5500_Interrupt=1;
	}
}

/*******************************************************************************
* 函数名  : SPI_Configuration
* 描述    : W5500 SPI初始化配置(STM32 SPI3)
* 输入    : 无
* 输出    : 无
* 返回值  : 无
* 说明    : 无
*******************************************************************************/
void SPI_Configuration(void)
{
			// 定义配置结构体,开启时钟
	GPIO_InitTypeDef GPIO_InitStructure;
	SPI_InitTypeDef SPI_InitStructure;
	RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_GPIOC, ENABLE);
	RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_GPIOF, ENABLE);
	RCC_APB1PeriphClockCmd(RCC_APB1Periph_SPI3,ENABLE);
	
	// 引脚复用
	GPIO_PinAFConfig(W5500_SPI3_PORT, GPIO_PinSource10, GPIO_AF_SPI3);
	GPIO_PinAFConfig(W5500_SPI3_PORT, GPIO_PinSource11, GPIO_AF_SPI3);
	GPIO_PinAFConfig(W5500_SPI3_PORT, GPIO_PinSource12, GPIO_AF_SPI3);
//	GPIO_PinAFConfig(W5500_SPI3_SCS_PORT, GPIO_PinSource4, GPIO_AF_SPI3);
	/* 初始化SCK */
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF;// 引脚复用
	GPIO_InitStructure.GPIO_OType = GPIO_OType_PP;// 推挽输出
	GPIO_InitStructure.GPIO_Pin = W5500_SPI3_SCK_PIN;
	GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_DOWN;// 下拉
	GPIO_InitStructure.GPIO_Speed = GPIO_High_Speed;
	GPIO_Init(W5500_SPI3_PORT, &GPIO_InitStructure);
	/* MISO、MOSI引脚 */
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF;// 引脚复用
	GPIO_InitStructure.GPIO_OType = GPIO_OType_PP;// 推挽输出
	GPIO_InitStructure.GPIO_Pin = W5500_SPI3_MISO_PIN | W5500_SPI3_MOSI_PIN;
	GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_UP;// 上拉
	GPIO_InitStructure.GPIO_Speed = GPIO_High_Speed;
	GPIO_Init(W5500_SPI3_PORT, &GPIO_InitStructure);
	/* 初始化SCS引脚 */
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_OUT;// 引脚复用
	GPIO_InitStructure.GPIO_OType = GPIO_OType_PP;// 推挽输出
	GPIO_InitStructure.GPIO_Pin = W5500_SPI3_SCS;
	GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_UP;// 上拉
	GPIO_InitStructure.GPIO_Speed = GPIO_High_Speed;
	GPIO_Init(W5500_SPI3_SCS_PORT, &GPIO_InitStructure);
	GPIO_SetBits(W5500_SPI3_SCS_PORT, W5500_SPI3_SCS);
	
	SPI_InitStructure.SPI_BaudRatePrescaler = SPI_BaudRatePrescaler_2;//  波特率预分频值：2
	SPI_InitStructure.SPI_CPHA = SPI_CPHA_1Edge;// 第二个时钟沿采样
	SPI_InitStructure.SPI_CPOL = SPI_CPOL_Low;// 串行同步时钟空闲状态为低电平
	SPI_InitStructure.SPI_CRCPolynomial = 7;// CRC校验
	SPI_InitStructure.SPI_DataSize = SPI_DataSize_8b;
	SPI_InitStructure.SPI_Direction = SPI_Direction_2Lines_FullDuplex;// 双向全双工
	SPI_InitStructure.SPI_FirstBit = SPI_FirstBit_MSB;// 高位在前
	SPI_InitStructure.SPI_Mode = SPI_Mode_Master;// 主模式
	SPI_InitStructure.SPI_NSS = SPI_NSS_Soft;// 软件拉高拉低片选线
	SPI_Init(SPI3, &SPI_InitStructure);
	// SPI外设使能
	SPI_Cmd(SPI3, ENABLE);
	
