SenHe524/stmf407_learn/stm32f407_w5500/User/w5500/W5500.c
}

/*******************************************************************************
* 函数名  : SPI3_Send_Byte
* 描述    : SPI3发送1个字节数据
* 输入    : dat:待发送的数据
* 输出    : 无
* 返回值  : 无
* 说明    : 无
*******************************************************************************/
unsigned char SPI3_Send_Byte(unsigned char dat)
{
	while(SPI_I2S_GetFlagStatus(SPI3, SPI_I2S_FLAG_TXE) == RESET);//等待数据寄存器空
	SPI_I2S_SendData(SPI3,dat);//写1个字节数据
	while(SPI_I2S_GetFlagStatus(SPI3, SPI_I2S_FLAG_RXNE) == RESET);
	return (unsigned char)SPI_I2S_ReceiveData(SPI3);
}

/*******************************************************************************
* 函数名  : SPI3_Send_Short
* 描述    : SPI3发送2个字节数据(16位)
* 输入    : dat:待发送的16位数据
* 输出    : 无
* 返回值  : 无
* 说明    : 无
*******************************************************************************/
void SPI3_Send_Short(unsigned short dat)
{
	SPI3_Send_Byte(dat/256);//写数据高位
	SPI3_Send_Byte(dat);	//写数据低位
}

/*******************************************************************************
* 函数名  : Write_W5500_1Byte
* 描述    : 通过SPI3向指定地址寄存器写1个字节数据
* 输入    : reg:16位寄存器地址,dat:待写入的数据
* 输出    : 无
* 返回值  : 无
* 说明    : 无
*******************************************************************************/
void Write_W5500_1Byte(unsigned short reg, unsigned char dat)
{
	GPIO_ResetBits(W5500_SPI3_SCS_PORT, W5500_SPI3_SCS);//置W5500的SCS为低电平

	SPI3_Send_Short(reg);//通过SPI3写16位寄存器地址
	SPI3_Send_Byte(FDM1|RWB_WRITE|COMMON_R);//通过SPI3写控制字节,1个字节数据长度,写数据,选择通用寄存器
	SPI3_Send_Byte(dat);//写1个字节数据

	GPIO_SetBits(W5500_SPI3_SCS_PORT, W5500_SPI3_SCS); //置W5500的SCS为高电平
}

/*******************************************************************************
* 函数名  : Write_W5500_2Byte
* 描述    : 通过SPI3向指定地址寄存器写2个字节数据
* 输入    : reg:16位寄存器地址,dat:16位待写入的数据(2个字节)
* 输出    : 无
* 返回值  : 无
* 说明    : 无
*******************************************************************************/
void Write_W5500_2Byte(unsigned short reg, unsigned short dat)
{
	GPIO_ResetBits(W5500_SPI3_SCS_PORT, W5500_SPI3_SCS);//置W5500的SCS为低电平
		
	SPI3_Send_Short(reg);//通过SPI3写16位寄存器地址
	SPI3_Send_Byte(FDM2|RWB_WRITE|COMMON_R);//通过SPI3写控制字节,2个字节数据长度,写数据,选择通用寄存器
	SPI3_Send_Short(dat);//写16位数据

	GPIO_SetBits(W5500_SPI3_SCS_PORT, W5500_SPI3_SCS); //置W5500的SCS为高电平
}

/*******************************************************************************
* 函数名  : Write_W5500_nByte
* 描述    : 通过SPI3向指定地址寄存器写n个字节数据
* 输入    : reg:16位寄存器地址,*dat_ptr:待写入数据缓冲区指针,size:待写入的数据长度
* 输出    : 无
* 返回值  : 无
* 说明    : 无
*******************************************************************************/
void Write_W5500_nByte(unsigned short reg, unsigned char *dat_ptr, unsigned short size)
{
	unsigned short i;

	GPIO_ResetBits(W5500_SPI3_SCS_PORT, W5500_SPI3_SCS);//置W5500的SCS为低电平	
		
	SPI3_Send_Short(reg);//通过SPI3写16位寄存器地址
	SPI3_Send_Byte(VDM|RWB_WRITE|COMMON_R);//通过SPI3写控制字节,N个字节数据长度,写数据,选择通用寄存器

	for(i=0;i<size;i++)//循环将缓冲区的size个字节数据写入W5500
	{
		SPI3_Send_Byte(*dat_ptr++);//写一个字节数据
	}

	GPIO_SetBits(W5500_SPI3_SCS_PORT, W5500_SPI3_SCS); //置W5500的SCS为高电平
}

/*******************************************************************************
* 函数名  : Write_W5500_SOCK_1Byte
* 描述    : 通过SPI3向指定端口寄存器写1个字节数据
* 输入    : s:端口号,reg:16位寄存器地址,dat:待写入的数据
* 输出    : 无
* 返回值  : 无
* 说明    : 无
*******************************************************************************/
void Write_W5500_SOCK_1Byte(SOCKET s, unsigned short reg, unsigned char dat)
{
	GPIO_ResetBits(W5500_SPI3_SCS_PORT, W5500_SPI3_SCS);//置W5500的SCS为低电平	
		
	SPI3_Send_Short(reg);//通过SPI3写16位寄存器地址
	SPI3_Send_Byte(FDM1|RWB_WRITE|(s*0x20+0x08));//通过SPI3写控制字节,1个字节数据长度,写数据,选择端口s的寄存器
	SPI3_Send_Byte(dat);//写1个字节数据

	GPIO_SetBits(W5500_SPI3_SCS_PORT, W5500_SPI3_SCS); //置W5500的SCS为高电平
}

/*******************************************************************************
* 函数名  : Write_W5500_SOCK_2Byte
* 描述    : 通过SPI3向指定端口寄存器写2个字节数据
* 输入    : s:端口号,reg:16位寄存器地址,dat:16位待写入的数据(2个字节)
* 输出    : 无
* 返回值  : 无
* 说明    : 无
*******************************************************************************/
void Write_W5500_SOCK_2Byte(SOCKET s, unsigned short reg, unsigned short dat)
{
	GPIO_ResetBits(W5500_SPI3_SCS_PORT, W5500_SPI3_SCS);//置W5500的SCS为低电平
			
	SPI3_Send_Short(reg);//通过SPI3写16位寄存器地址
	SPI3_Send_Byte(FDM2|RWB_WRITE|(s*0x20+0x08));//通过SPI3写控制字节,2个字节数据长度,写数据,选择端口s的寄存器
	SPI3_Send_Short(dat);//写16位数据

	GPIO_SetBits(W5500_SPI3_SCS_PORT, W5500_SPI3_SCS); //置W5500的SCS为高电平
}

/*******************************************************************************
* 函数名  : Write_W5500_SOCK_4Byte
* 描述    : 通过SPI3向指定端口寄存器写4个字节数据
* 输入    : s:端口号,reg:16位寄存器地址,*dat_ptr:待写入的4个字节缓冲区指针
* 输出    : 无
* 返回值  : 无
* 说明    : 无
*******************************************************************************/
void Write_W5500_SOCK_4Byte(SOCKET s, unsigned short reg, unsigned char *dat_ptr)
{
	GPIO_ResetBits(W5500_SPI3_SCS_PORT, W5500_SPI3_SCS);//置W5500的SCS为低电平
			
	SPI3_Send_Short(reg);//通过SPI3写16位寄存器地址
	SPI3_Send_Byte(FDM4|RWB_WRITE|(s*0x20+0x08));//通过SPI3写控制字节,4个字节数据长度,写数据,选择端口s的寄存器

	SPI3_Send_Byte(*dat_ptr++);//写第1个字节数据
	SPI3_Send_Byte(*dat_ptr++);//写第2个字节数据
	SPI3_Send_Byte(*dat_ptr++);//写第3个字节数据
	SPI3_Send_Byte(*dat_ptr++);//写第4个字节数据

	GPIO_SetBits(W5500_SPI3_SCS_PORT, W5500_SPI3_SCS); //置W5500的SCS为高电平
}

/*******************************************************************************
* 函数名  : Read_W5500_1Byte
* 描述    : 读W5500指定地址寄存器的1个字节数据
* 输入    : reg:16位寄存器地址
* 输出    : 无
* 返回值  : 读取到寄存器的1个字节数据
* 说明    : 无
*******************************************************************************/
unsigned char Read_W5500_1Byte(unsigned short reg)
{
	unsigned char i = 0;

	GPIO_ResetBits(W5500_SPI3_SCS_PORT, W5500_SPI3_SCS);//置W5500的SCS为低电平
			
	SPI3_Send_Short(reg);//通过SPI3写16位寄存器地址
	SPI3_Send_Byte(FDM1|RWB_READ|COMMON_R);//通过SPI3写控制字节,1个字节数据长度,读数据,选择通用寄存器

//	i=SPI_I2S_ReceiveData(SPI3);
	i=SPI3_Send_Byte(0x00);//发送一个哑数据
//	i=SPI_I2S_ReceiveData(SPI3);//读取1个字节数据

	GPIO_SetBits(W5500_SPI3_SCS_PORT, W5500_SPI3_SCS);//置W5500的SCS为高电平
	return i;//返回读取到的寄存器数据
}

/*******************************************************************************
* 函数名  : Read_W5500_SOCK_1Byte
* 描述    : 读W5500指定端口寄存器的1个字节数据
* 输入    : s:端口号,reg:16位寄存器地址
* 输出    : 无
* 返回值  : 读取到寄存器的1个字节数据
* 说明    : 无
*******************************************************************************/
unsigned char Read_W5500_SOCK_1Byte(SOCKET s, unsigned short reg)
{
	unsigned char i;

	GPIO_ResetBits(W5500_SPI3_SCS_PORT, W5500_SPI3_SCS);//置W5500的SCS为低电平
			
	SPI3_Send_Short(reg);//通过SPI3写16位寄存器地址
	SPI3_Send_Byte(FDM1|RWB_READ|(s*0x20+0x08));//通过SPI3写控制字节,1个字节数据长度,读数据,选择端口s的寄存器

//	i=SPI_I2S_ReceiveData(SPI3);
	i=SPI3_Send_Byte(0x00);//发送一个哑数据
//	i=SPI_I2S_ReceiveData(SPI3);//读取1个字节数据

	GPIO_SetBits(W5500_SPI3_SCS_PORT, W5500_SPI3_SCS);//置W5500的SCS为高电平
	return i;//返回读取到的寄存器数据
}

